import React from 'react';
import bg from '../../assets/bgbk.png';
import bismillah from '../../assets/bismillah.png';


const IntroductionOfMadrasha = () => {
    return (
        <div className="bg-cover bg-center" style={{ backgroundImage: `url(${bg})`, aspectRatio: '100/100' }}>
            <div className='pt-56 lg:pt-80'>
                <div className='flex justify-center'>
                    <img src={bismillah} alt="" className='w-60 lg:w-96' />
                </div>
                <h1 className='text-gray-700 text-center text-2xl lg:text-3xl font-bold mt-5'>মাদরাসা পরিচিতি</h1>
                <hr className='w-64 mx-auto border-[2px] border-[#DAA520] mt-2'/>
                <p className='text-gray-700 max-w-3xl mx-auto text-justify lg:text-2xl px-4 my-10'>
                    কালনা আইমানিয়া ফাজল (রাঃ) মাদ্রাসার উৎসবের সময় ১৯৩৫ সালের বিশেষ উল্লেখ্য ঘটনা ঘটে। এই মাদ্রাসা, যা ইউপি, বাংলাদেশের কালীগঞ্জ উপজেলার রামশরণ এলাকায় অবস্থিত, প্রথম আগমনের সময়ের অসাধারণ উৎসব প্রদর্শন করে। এই মাদ্রাসার প্রধান অনুষ্ঠানিক প্রধান অধ্যাপক আল্লামা রহমান (রাঃ)। প্রয়োজনে মাদ্রাসার বিভিন্ন পিঠে মাদ্রাসার ধাপে ধাপে প্রবেশ করে। মাদ্রাসায় এই তারিখের প্রথম ভর্তি প্রারম্ভিক শিক্ষার্থী লাভ করে। পরে ০১/০১/১৯৭৩ তারিখে আগমনের জন্য সীমিত সংখ্যক আলোচিত হয়। তারপরে ০১/০৭/১৯৭৮ এবং ০১/০৭/১৯৮৭ তারিখে আগমন সম্পন্ন হয়। এর পাশাপাশি, মাদ্রাসার পূর্বে অধ্যয়ন এবং কম্পিউটার বিভাগ প্রারম্ভিক আলোচনা হয়। এই মাদ্রাসার প্রস্তুতির লক্ষ্যে নামাজ ও কোম্পিউটার বিভাগের প্রয়োজনীয় সুযোগ তৈরি করা হয়েছে। মাদ্রাসাটির জমির মোট পরিমাণ ৭.৪৪ একর। প্রত্যেকের পক্ষ হালনাগার সুস্থ বন্ধুর প্রতি শিক্ষা-কৌশল ও আদর্শ নিয়ে অত্যন্ত সচেতন। যান-জানানার পাশাপাশি, এই মাদ্রাসাটির জন্য একাধিক সোশ্যাল কার্যক্রম বিদ্যমান। মাদ্রাসার অন্যান্য গৌরবময় প্রতীকগুলি অন্তর্ভুক্ত হয়েছে যেমনঃ বই ও কম্পিউটার শাখা, লাইব্রেরি ও ফাহমিদা খানম জামে মসজিদের উন্নতি। এছাড়াও, প্রতিবছরে মাদ্রাসাটিতে খেলাধুলার সময়ে বিভিন্ন খেলাধুলার প্রতিষ্ঠানের মধ্যে কালীগঞ্জ জেলার ফুটবল অংশগ্রহণের সুযোগ তৈরি করা হয়েছে। এই মহৎ অংশগ্রহণের স

                    ময়ে, বর্তমানের বিভিন্ন বিষয়ে জ্ঞান-অভিজ্ঞতার পাশাপাশি, সামাজিক কার্যক্রমে অনেক গুরুত্বপূর্ণ ভূমিকা পালন করা হয়েছে।</p>
            </div>
        </div>
    );
};

export default IntroductionOfMadrasha;

