import React from 'react';
import bg from '../../assets/bgbk.png';
import bismillah from '../../assets/bismillah.png';


const IntroductionOfMadrasha = () => {
    return (
        <div className="bg-cover bg-center" style={{ backgroundImage: `url(${bg})`, aspectRatio: '100/100' }}>
            <div className='pt-56 lg:pt-80'>
                <div className='flex justify-center'>
                    <img src={bismillah} alt="" className='w-60 lg:w-96' />
                </div>
                <h1 className='text-gray-700 text-center text-2xl lg:text-3xl font-bold mt-5'>মাদরাসা পরিচিতি</h1>
                <hr className='w-64 mx-auto border-[2px] border-[#DAA520] mt-2'/>
                <p className='text-gray-700 max-w-3xl mx-auto text-justify lg:text-2xl px-4 my-10'>
                কালনা আমিনিয়া ফাজিল (ডিগ্রি) মাদরাসাটি ১৯৩৫ খ্রিস্টাব্দে পাক ভারত উপমহাদেশের শ্রেষ্ঠ ওলিকুল শিরোমনি আল্লামা রুহুল আমিন (রহ.) এর পরামর্শক্রমে তৎকালীন কালনা ও পার্শ্ববর্তী গ্রামের মুরুব্বীদের সমন্বয়ে মাদরাসাটি প্রতিষ্ঠিত হয়। বিভিন্ন প্রতিকূল অবস্থার মধ্য দিয়ে মাদরাসাটি ধাপে ধাপে এগিয়ে যায়। মাদরাসাটিতে ০১/০১/১৯৭৩ খ্রিস্টাব্দে প্রথম দাখিল পর্যায়ের স্বীকৃতি লাভ করে। তারপর ০১/০৭/১৯৭৮ খ্রিস্টাব্দে আলিম এবং ০১/০৭/১৯৮৭ খ্রিস্টাব্দে ফাজিল(স্নাতক) স্বীকৃতি লাভ করে। তাছাড়া প্রতিষ্ঠানটিতে বিজ্ঞান ও কম্পিউটার শাখা চালু আছে। বর্তমানে মাদরাসাটি কামিল পর্যায়ে উন্নত করার প্রচেষ্টা অব্যাহত রয়েছে। মাদরাসাটির নিজস্ব জমি পরিমাণ ৭.৪৪ একর। প্রতিষ্ঠানটি দক্ষিণ খুলনার সুন্দরবনের পাদদেশে খুলনা-কয়রা মহাসড়কের পাশে কপোতাক্ষ নদের তীরে অবস্থিত হলেও দ্বীনি শিক্ষা বিস্তারে দেশের উল্লেখযোগ্য একটি বিদ্যাপীঠ হিসেবে সকলের কাছে সর্বজনবিদিত। জ্ঞান-বিজ্ঞানের পাশাপাশি নৈতিক শিক্ষার ক্ষেত্রে মাদরাসাটি তার অমূল্য অবদান রেখে চলেছে। তাছাড়া ক্রীড়াঙ্গনে প্রতিষ্ঠানটির বেশ উল্লেখযোগ্য ভূমিকা আছে। ২০২৩ খ্রিস্টাব্দে ফুটবলে বিভাগীয় চ্যাম্পিয়ান হয়ে ক্রীড়াঙ্গনে শীর্ষ স্থান অধিকার করে।একই বছরে প্রতিষ্ঠানটি খুলনা জেলার একটি শ্রেষ্ঠ শিক্ষা প্রতিষ্ঠান হিসেবে সকলের কাছে পরিচিতি লাভ করে। উল্লেখ্য যে ১৩ জুন ২০২০ তৎকালীন সেনাবাহিনী প্রধান এম এ আজিজ মাদরাসাটি সরেজমিনে পরিদর্শন করেন।তাছাড়া লেখাপড়ার পাশাপাশি বিভিন্ন ক্ষেত্রে অবিস্মরণীয় অবদান রেখে স্বগৌরবে মাথা উঁচু করে দাঁড়িয়ে আছে। শেখ রাসেল ডিজিটাল ল্যাব,মুজিব কর্নার,আমিনিয়া মাদ্রাসা মার্কেট,লিল্লাহ বোর্ডিং,বিজ্ঞানাগার,লাইব্রেরী ও ফাতেমা খানম জামে মসজিদ মাদরাসাটির উল্লেখযোগ্য কমপ্লেক্স।প্রতিষ্ঠানটি জ্ঞান-বিজ্ঞান ও নৈতিক শিক্ষার প্রাণকেন্দ্র হিসেবে সকলের কাছে সু-পরিচিত।
</p>
            </div>
        </div>
    );
};

export default IntroductionOfMadrasha;

