import React from 'react';
import Marquee from 'react-fast-marquee';

const Headline = () => {
    return (
        <div className='py-5'>
            <Marquee>
                <p>মাধ্যমিক বিদ্যালয়ে ভর্তি: অনলাইনে আবেদন শুরু ২৪ অক্টোবর, পছন্দক্রম ৫টি বিদ্যালয়</p>
                <p>মাধ্যমিক বিদ্যালয়ে ভর্তি: অনলাইনে আবেদন শুরু ২৪ অক্টোবর, পছন্দক্রম ৫টি বিদ্যালয়</p>
                <p>মাধ্যমিক বিদ্যালয়ে ভর্তি: অনলাইনে আবেদন শুরু ২৪ অক্টোবর, পছন্দক্রম ৫টি বিদ্যালয়</p>
                <p>মাধ্যমিক বিদ্যালয়ে ভর্তি: অনলাইনে আবেদন শুরু ২৪ অক্টোবর, পছন্দক্রম ৫টি বিদ্যালয়</p>
                <p>মাধ্যমিক বিদ্যালয়ে ভর্তি: অনলাইনে আবেদন শুরু ২৪ অক্টোবর, পছন্দক্রম ৫টি বিদ্যালয়</p>
            </Marquee>
        </div>
    );
};

export default Headline;